"""
Дано n є N. Побудувати алгоритм для визначення того,
 чи утворюють цифри арифметичну прогресію.

"""
# 0 задання
"""
n1, n2, n3 - int - числа(логічно).
d1, d2 - int - фіксована різниця між попереднім і настуним
"""
n1 = int(input("Введіть перше число: "))
n2 = int(input("Введіть друге число: "))
n3 = int(input("Введіть третє число: "))
d1 = n1 - n2
d2 = n2 - n3
if d1 == d2:
    print("числа належать арифметичній прогресії")
else:
    print("числа не належать арифметичній прогресії")