"""
Дано послідовність натуральних числень a1, a2, ... an. Використовуючи підпрограму, яка дозволяє встановити, чи є послідовність
 із чотирьох чисел геометричною прогресією, знайти кількість послідовно розміщених четвірок чисел, які
 утворюють геометричну прогресію.

"""
#bn= b1 * q**(n-1)
def G_progression(n,a):
    q = a[1]/a[0]
    x = 1
    for i in range(1,n):
        if a[i]/a[i-1] == q:
            x += 1
        else: continue
    return x

a = []
n = int(input("введіть кількість чисел:"))
if n <= 3:
    print("данну задачу розвязати не можна")
else:
    for i in range(n):
        a.append(int(input(f"введіть {(i + 1)} число: ")))
    print("геометрична прогресія з {0} чисел".format(G_progression(n,a)))
